#pt.tcl
#===================set variable===================
source ./Scripts/setting.tcl -echo
#
set task power_syn_L2
set waveform Random_L2.vcd
set waveform_fsdb Random_L2.fsdb
#set testbench Top_syn_tb
set testbench Top_postsim_tb
set syn_apr syn
set Period 2.8
#
#===================setup===================
#source ./Scripts/setup.tcl
set company "CIC"
set designer "Student"
#
set_app_var search_path "$search_path . "
set_app_var link_path " * "
if {$MultiVt == 0} {
	lappend search_path "$dc_path/sc9_base_hvt"
	#lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_ss_typical_max_0p81v_m40c.db"
	lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_tt_typical_max_0p90v_25c.db"
} elseif {$MultiVt == 1} {
	lappend search_path "$dc_path/sc9_base_hvt"
	lappend search_path "$dc_path/sc9_base_rvt"
	lappend search_path "$dc_path/sc9_base_lvt"
	#lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_ss_typical_max_0p81v_m40c.db"
	#lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_ss_typical_max_0p81v_m40c.db"
	#lappend link_path "$dc_path/sc9_base_lvt/sc9_cln40g_base_lvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_lvt/sc9_cln40g_base_lvt_ss_typical_max_0p81v_m40c.db"
	lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_tt_typical_max_0p90v_25c.db"
	lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_tt_typical_max_0p90v_25c.db"
	lappend link_path "$dc_path/sc9_base_lvt/sc9_cln40g_base_lvt_tt_typical_max_0p90v_25c.db"
} elseif {$MultiVt == 2} {
	lappend search_path "$dc_path/sc9_base_lvt"
	#lappend link_path "$dc_path/sc9_base_lvt/sc9_cln40g_base_lvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_lvt/sc9_cln40g_base_lvt_ss_typical_max_0p81v_m40c.db"
	lappend link_path "$dc_path/sc9_base_lvt/sc9_cln40g_base_lvt_tt_typical_max_0p90v_25c.db"
} elseif {$MultiVt == 3} {
	lappend search_path "$dc_path/sc9_base_hvt"
	lappend search_path "$dc_path/sc9_base_rvt"
	#lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_ss_typical_max_0p81v_m40c.db"
	#lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_ss_typical_max_0p81v_m40c.db"
	lappend link_path "$dc_path/sc9_base_hvt/sc9_cln40g_base_hvt_tt_typical_max_0p90v_25c.db"
	lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_tt_typical_max_0p90v_25c.db"
} elseif {$MultiVt == 4} {
	lappend search_path "$dc_path/sc9_base_rvt"
	#lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_ss_typical_max_0p81v_125c.db"
	#lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_ss_typical_max_0p81v_m40c.db"
	lappend link_path "$dc_path/sc9_base_rvt/sc9_cln40g_base_rvt_tt_typical_max_0p90v_25c.db"
} else {
	echo "Error! MVt not set!"
}
#
#set hdlin_translate_off_skip_text "TRUE"
#set edifout_netlist_only "TRUE"
#set verilogout_no_tri true
#
#set hdlin_enable_presto_for_vhdl "TRUE"
#set sh_enable_line_editing true
#set sh_line_editing_mode emacs
history keep 100
alias h history
#
#set bus_inference_style {%s[%d]}
#set bus_naming_style {%s[%d]}
#set hdlout_internal_busses true
#define_name_rules name_rule -allowed {a-z A-Z 0-9 _} -max_length 255 -type cell
#define_name_rules name_rule -allowed {a-z A-Z 0-9 _[]} -max_length 255 -type net
#define_name_rules name_rule -map {{"\\*cell\\*" "cell"}}
#===================set option===================
set sh_source_uses_search_path true
set power_enable_analysis true
set power_analysis_mode time_based
set power_report_leakage_breakdowns true
#===================read file===================
read_verilog ./Output/${Top_name}_${syn_apr}.v
current_design ${Top_name}
link
#===================timing===================
read_sdc ./Output/${Top_name}_${syn_apr}.sdc
read_sdf ./Output/${Top_name}_${syn_apr}.sdf
#
#check_timing
#Checks the assertions and structure of the design for potential timing violations.
#This command is used to identify possible problems before generating timing or constraint reports. 
check_timing
#
#update_timing
#Updates timing for the current design.
#Timing is also automatically updated by commands that need the information, such as the report_timing command.
#This command explicitly prepares the design for further analysis.
update_timing
#===================power===================
#
#check_power
#Shows possible power problems for design and specific cell object_list.
check_power
#
#read_vcd
#Specifies the switching activity information generated by simulation for use in power calculation.
#Internally, non-VCD format switching activity is converted to VCD.
#-strip_path
#Specifies a path prefix that is to be stripped from all the object names read from the VCD file.
#This option is applied to strip the testbench and instance path from the VCD file.
read_vcd -time {0 -1} -strip_path ${testbench}/TOP ${waveform}
#read_fsdb -strip_path Top_syn_tb/TOP ${waveform_fsdb}
#
#check_activity
#Check the VCD and FSDB file and reports any unannotated, X, Z, or unconnected states of the input signals.
#check_activity [get_pins *]
#
#set_power_analysis_options
#Sets the options for power analysis.
#-include
#Specifies the objects in the design hierarchy to be monitored for waveform generation.
#The tool will only be able to show the power waveforms limited by this option.
#There are three allowed values for the option.
#If the value is top, only the top-level design is monitored for power waveform generation.
#If the value is all_without_leaf, all design hierarchies except leaf cells are monitored.
#If the value is all_with_leaf, all design hierarchies including leaf cells are monitored.
#The default value is all_without_leaf. This option applies only to time_based power analysis.
#set_power_analysis_options -include all_with_leaf
#
#write_activity_waveforms
#Creates activity waveforms from the Value Change Dump (VCD).
#write_activity_waveforms -format fsdb -output ${task}.fsdb -vcd ${waveform} -time {0 -1} -interval 0.1
#
#report_activity_waveforms
#Reports on activity analysis of VCD.
#report_activity_waveforms > ./Report/${task}_activity.rpt
#update_power
#Updates power information on the current design.
update_power
#===================report===================
report_power -hierarchy > ./Report/${task}_summary.rpt
#===================save session===================
save_session ./${task}
#restore_session
#Restore a PrimeTime session from a directory saved by the save_session command.